Revit 2027 API
ViewSchedule.EmbeddedDefinition Property
 The embedded ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleDefinition EmbeddedDefinition { get; }
Public ReadOnly Property EmbeddedDefinition As ScheduleDefinition
	Get
public:
property ScheduleDefinition^ EmbeddedDefinition {
	ScheduleDefinition^ get ();
}
member EmbeddedDefinition : ScheduleDefinition with get
Property Value
ScheduleDefinition
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace